       01 TRXN-REC.
          05 TRXN-ID     PIC 9(9) COMP-3.
          05 TRXN-DT     PIC X(8).
          05 TRXN-TM     PIC X(6).
          05 TRXN-AMNT   PIC S9(7)V9(2) COMP-3.
