000100 01 SAMPLE-RECORD.
000200 05 HEADER-GROUP.
000300* THIS FIXED-FORMAT COMMENT MUST BE IGNORED.
000400 10 CUSTOMER-NAME PIC X(10).
000500 10 FILLER PIC X(2).
000600 10 ACCOUNT-NUMBER PIC 9(4) DISPLAY.
000700 10 INTEREST-RATE PIC 9(5)V9(2) DISPLAY.
000800 10 BALANCE-BIN PIC S9(4) COMP.
000900 10 RATE-BIN PIC 9(5)V9(2) BINARY.
001000 10 AMOUNT-PACKED PIC S9(7)V9(2) COMP-3.
001100 10 FILLER PIC X.
